Tinkerbug-Robotics/TinkerRocket/tinkerrocket-idf/projects/base_station/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# BLE / NimBLE
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
# #505: at INFO, NimBLE emits three lines per telemetry notify (~2/s for the whole
# session) — "GATT procedure initiated: notify; att_handle=16". In a 96 s bench run
# that was the overwhelming majority of the console and it buried the BS's own
# [RX]/[STATS]/[UPLINK]/[BATT] lines, which are the ones you actually watch during
# a flight. Also costs CPU + UART bandwidth on the hot notify path.
CONFIG_BT_NIMBLE_LOG_LEVEL_WARNING=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y

# Power management (base station is battery-powered)
CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_FREERTOS_IDLE_TIME_BEFORE_SLEEP=3
CONFIG_ESP_PHY_MAC_BB_PD=y

# BLE controller modem sleep — radio powers down between BLE events (#518).
# This block used to be a single CONFIG_BT_NIMBLE_SLEEP_ENABLE=y, which is NOT a
# real kconfig symbol (absent from the bt component's Kconfig AND from its
# sdkconfig.rename map), so kconfgen silently dropped it and the BS shipped with
# BT_CTRL_MODEM_SLEEP=0 — the controller never slept between BLE events. The
# sleep knob is controller-side, not NimBLE-host-side. These are the same three
# lines the out_computer has been running, so this is a proven config, not a new one.
#
# On the LPCLK choice: LPCLK_SEL_RTC_SLOW is ruled out by IDF's own help — the
# internal 136 kHz RC is far outside the 500 ppm BLE needs to hold a connection.
# LPCLK_SEL_EXT_32K_XTAL would use the board's 32.768 kHz crystal and is the
# better answer for idle power (the main crystal can stay powered down), but it
# needs CONFIG_RTC_CLK_SRC_EXT_CRYS=y, which no project has ever set — the whole
# fleet runs the RTC on the internal RC. That is being addressed separately, and
# on the OUT COMPUTER first, where low-power mode is actually used; the BS does
# not use low-power mode, so MAIN_XTAL is the right trade here.
CONFIG_BT_CTRL_MODEM_SLEEP=y
CONFIG_BT_CTRL_MODEM_SLEEP_MODE_1=y
CONFIG_BT_CTRL_LPCLK_SEL_MAIN_XTAL=y

# Flash — 8 MB, which is the SMALLEST boot NOR across the base stations, not
# the typical one. The two ways of getting this wrong are not symmetric:
#
#   too small   benign. Boots, logs "Detected size(16384k) larger than the size
#               in the binary image header(8192k)", leaves the top of the part
#               unreachable.
#   too large   FATAL, and in the bootloader, so no firmware ever runs to say so:
#                 E spi_flash: Detected size(8192k) smaller than the size in the
#                              binary image header(16384k). Probe failed.
#               A continuous boot loop on a board that is perfectly good.
#
# U1 was a W25Q64JVXGIQ (8 MB) until the 2026-08-09 fab close-out and a
# W25Q128JVSIQ / GD25Q128ESIG (16 MB) after it — hardware/base-station/bom.csv
# across 199ecec -> 98f6e06, the same swap the rocket computer got on the same
# day. V1 and V2 predate it; V3 (the PCB V5/V6 hardware) is the 16 MB board.
#
# V3 raises this to 16 MB in sdkconfig.defaults.v3, which ALSO switches the
# partition table — unlike the other projects, the two are coupled here, see
# partitions.csv. 8 MB is the base because TR_BS_BOARD is optional and defaults
# to V2: a flagless build must not produce an image that bricks the boot of the
# bench base station.
#
# Not measured with `esptool flash-id`, but not a guess either: it follows the
# BOM history and the fab date, and the board owner confirmed the general rule
# on 2026-08-24 — the latest revision of each board is 16 MB, every earlier one
# is 8 MB. It is also the forgiving direction; 8 MB boots on either part.
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# OTA rollback: new images boot as PENDING_VERIFY and auto-roll back to ota_0
# unless app calls esp_ota_mark_app_valid_cancel_rollback() after first
# successful telemetry round-trip. See docs/plans/08-ota-firmware-update.md §4.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Serial
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# FAT filesystem — enable long filenames (required for timestamped CSV logs)
CONFIG_FATFS_LFN_HEAP=y
